{
    "asin": "B0765ZVM6Y",
    "product_name": "Sony NW-A45/B Walkman with Hi-Res Audio, Grayish Black (2018 Model)",
    "review_list": [
        {
            "author": "60's 70's 80's Music Lover",
            "headline": "Easy to set up, can hold my entire CD collection (over 7000 songs) for Bluetooth in cars and home!",
            "rating": 5,
            "review_text": "This is the first Walkman I have ever bought but I wanted something that I could record my entire CD collection (over 7000 songs) as a backup for my smartphone and computer.  With an optional 128GB micro SD card, it held all songs at 192 bit rate (or higher) with very clean sound reproduction via Sony MDR-1 headphones and Sony SRS X99 bluetooth speaker.  Incredible!!  I like high quality sound and this little Walkman (smaller than a pack of cigarettes) does a very good job.  With the equalizer and other sound presentation options, it met all my expectations.  Set up was intuitive and easy, even for someone who has a heck of a time with simple computer functions.  Good music doesn't get much better!!!"
        },
        {
            "author": "blorg1984",
            "headline": "just ok",
            "rating": 3,
            "review_text": "i like the look and feel. i’m not a fan of the digital upscaling and filters. sound is meh. i have a bias against portable audio."
        },
        {
            "author": "C Heyl",
            "headline": "Buyer beware",
            "rating": 2,
            "review_text": "The product page says USB cable, but the cable is not a typical USB cable, it is a proprietary Sony cable. So much for using one of the many USB cables that I have lying around at home, in car, at work to charge the player.This player could not play the music on my SD card unless I format it in the player.I returned this item and replaced it with the Cowon Plenue D player. I am very glad I did. The Cowon sounds great, was $25 cheaper than the Sony, has double the memory (32GB instead of 16GB), has double the battery life (100 hours instead of 45 hours) can be charged with a standard USB cable and plays the music on my SD card without having to re-format the card and copy all my music again."
        },
        {
            "author": "Jeferey Light",
            "headline": "It's a very nice MP3 player",
            "rating": 3,
            "review_text": "It's a very nice MP3 player, for purchased music. HOWEVER, if you use a music subscription service and Windows computer, it won't meet your needs. Had to return it."
        },
        {
            "author": "Jedi Jamie J",
            "headline": "Five Stars",
            "rating": 5,
            "review_text": "Sweet little walkman. Fantastic sound (very music and good sound staging). Nice touch screen.  Good battery.  Easy to use."
        },
        {
            "author": "D K",
            "headline": "No Cover Art",
            "rating": 2,
            "review_text": "Had multiple issues with the software Sony suggested for transferring music. Gave up and transferred directly.  Tried a couple different ways and never could get any of the album art to display on the player. Sony support was not helpful.  It might not be an issue for some but a lot of the appeal of a player with a screen is seeing the album art so for me that is a deal breaker. I have an old Zune player that displays the art just fine.  Hard to believe this is even an issue from a company like Sony."
        },
        {
            "author": "W. E. Gabbert",
            "headline": "One Star",
            "rating": 1,
            "review_text": "Music downloaded on the could not located and therefore unable to play. A serious flaw."
        },
        {
            "author": "Audio Man",
            "headline": "Solid personal music player",
            "rating": 5,
            "review_text": "Would be hard to justify the price for non audiophiles but this is the absolute best personal music player out there. Others such as the plenue d have issues with recognizing higher sd cards but I have used 512gb sds with the walkman issue free. Battery life is great and can be on standby for a very long time. It can function as a usb dac which is a very appreciated bonus and defiantly comes in handy more than I expected it to."
        },
        {
            "author": "Will",
            "headline": "Finally, a good sounding portable walkman!",
            "rating": 5,
            "review_text": "This Sony Hi-Res Walkman is better than my IPOD in terms of sound quality.  And it has nothing to do with compressed audio files.  LOL.  There is a more open soundstage and clarity to the instruments and voices that is not present with my Ipod.The software that is used to add files to the Walkman is not bad, but it's not I-Tunes either.  I found it to be a little quirky at first, but I soon got the hang of it to add or remove music to the device.  Do yourself a favor and buy a Micro SD storage card to add extra storage,  16GB is all you get.  And with the potential to save higher bitrate files, you will soon need it if you have a lot of music in your library.The battery lasts a decent amount of time and you can place the unit in a standby mode when you are not listening.  If you like good sounding music or you are an audiophile on a budget, then the player is a recommended buy.If you only want to play your MP3's, then there are cheaper options out there that won't sound as good as the Sony.  Good luck!"
        },
        {
            "author": "Tess Stickles",
            "headline": "Perfectly sized and priced DAP",
            "rating": 4,
            "review_text": "I'm very surprised by this device.  I had previously owned a Fiio X5III and Cayin N3 among others.  Since I listen to music mainly on the go, I was looking for something really portable and not cumbersome but that also had great sound.  This pretty much does that for me.I use these with a pair of Sony MDR7550's and listening to 192/24 and 44.1/16  FLAC files  in various genres.  I did have to spend a good amount of time EQ'ing this to make it sound great, which on devices like the Fiio X5III, I spent a minimal amount of time doing.  Right out of the box with programmed EQs, I found the sound of the A45 extremely harsh with the highs making it almost unlistenable.  Since there were so many people online who had praised Sony products like this and the ZX300 (which I was told had a slightly similar sound signature to this but without balanced capability), I was determined to figure out why the Sony Walkman without streaming capabilities still remained a competitor.With some tweaking, I was able to get this to sound pretty amazing.  Not sure if it's just my ears getting used to the sound but I find it to be very clear and detailed.  Still not as warm and as open as I remember the Fiio (even via bluetooth) to be but much better than my iPhone obviously.  I love the way the Sony Walkman looks.  The chassis is rounded and comfortable to hold in your hand or slip in your pocket as opposed to other devices which insist on making a DAP look and feel like a luxury device.  The A45 is not a burden to carry around.  I can pick it up, put it back down or toss it in my backpack without worrying that I might damage the glass front or back as I would with the Fiio.  There are also a variety of accessories for this on Amazon such as various cases, charging cables (hate the proprietary aspect though), and screen protectors which are more difficult to find for other devices.This device is AptX capable, which is an upgrade from the A35.  The drawback is that the EQ nor any of the sound settings seem to work over bluetooth unless you have a pair of NFC capable Sony headphones.  Instead of telling you that the sound settings are disabled, you'll sit there and adjust settings a while before you realize that nothing is happening.  I tested with a pair of Bose QC35's and the sound over bluetooth is acceptable but not as good as over a wired connection.As far as general features, I'm disappointed that there's no crossfade option on here.  Also, playlist creation is kind of annoying for this Mac user but I've yet to find any DAP that's mastered that anyway.  When I create a playlist on this, I use M3Unify and create a few basic playlists.  You can add files to that playlist from within the player.  You cannot, however, create a new playlist on the fly without using a computer and that I find pretty annoying.  I have not had any difficulty adding album art but I generally add that to Phile Audio as I'm ripping my discs.In all this is a pretty good player.  Sometimes I get curious and lust after the ZX300 just because I feel like I must be missing out on something but I honestly do feel like the price point, size and sound quality justifies giving the A45 a shot. I find myself streaming a lot less and getting back into actually enjoying a full album vs the frenetic style of listening I do via streaming."
        },
        {
            "author": "Jayme Swier",
            "headline": "Better Sounding with Multiple Features,",
            "rating": 5,
            "review_text": "Stores all the songs in all the formats.  The sd card slot allows for more storage without buying a more expensive model.  Blue tooth works great in both headphones and the speaker,  The only drawback is that the album art did not transfer on all songs."
        },
        {
            "author": "Amazon Customer",
            "headline": "Truly Awesome!",
            "rating": 5,
            "review_text": "This little Sony Walkman NW-A45/B is awesome. The sound quality is really outstanding and the ability to set the music to your liking is great. It also provides FM Radio where you can preset favorite stations and it stores a tremendous amount of your music. This is the third Sony Walkman I have owned and this new 2018 model is really sensational. Perfect for walkers, beach goers and simply music lovers. Totally recommend this Sony Walkman with an added SanDisk 128GB for greater capacity."
        },
        {
            "author": "Ryan McQuiston",
            "headline": "Fantastic quality. Slow to turn on",
            "rating": 4,
            "review_text": "Fantastic quality. Slow to turn on, but really great music player. Lots of gizmos. My iMac sometimes ejects it when I’m trying to load files, I always Have to double check that the files actually work after. But.. worth it."
        },
        {
            "author": "PatchMan2112",
            "headline": "Very Satisfied I Would Recommend",
            "rating": 5,
            "review_text": "Compared to Cowin Plenue D and Pioneer XDP-30R, my sound preferences were much easier to tune. IMO... Sony delivers what the others fall short on sound quality, without a headphone amp. The sound quality of music streaming isn't very good too me. So... Wi-Fi doesn't matter. Bluetooth sounds great on my Home AVR. The music sounds as clear as CD with gapless playback. It doesn't have as much SD Card space as some others, but I very satisfied. I would recommend."
        },
        {
            "author": "C. Adam",
            "headline": "Beautiful sound and excellent bluetooth capability",
            "rating": 5,
            "review_text": "As a casual audiophile I was happy with the new A45/B.  It did everything I expected it to do and the sound is obviously better than your normal headphone listening devices. It wasn't until I connected its bluetooth to my vehicle stereo that I became very impressed.  To me, this is where it shines.  I turned on the ClearAudio function and have never heard such beautiful sounds in my vehicle (it also improves the headphone listening).  Everything was crystal clear and tight.  Now I want to connect this thing to every wireless sound device I have.  I've seen others complain about lagging screen scrolling and other issues, but so far I've had no issues with the software and functionality.  Maybe this newer version is better, and I also updated the firmware via Sony's website. I used the DAC function through my computer and was happy with it as well, although I have other more expensive devices connected that do a slightly better job (but the cost is much more and the functions are limited in comparison). For the price point, I'm very happy with this Walkman - lots of fun."
        },
        {
            "author": "Donnie Green",
            "headline": "Great Bluetooth Range, Even through walls.",
            "rating": 5,
            "review_text": "Perfect, Great Interface, Xlnt sound and bass, More than 30ft Lossless Bluetooth distance with walls in the way. WOW!"
        },
        {
            "author": "ANDRVOLK",
            "headline": "Download Sony software!!! To your micro CD card!!",
            "rating": 5,
            "review_text": "Awesome sound, very good piece!! BEFORE DOWNLOAD YOUR OWN MUSIC TO NEW MICROCD CARD, you have to install Sony software by formating inside your Walkman, than  download music to Music file, otherwise without formating you card Walkman does not see your music mp3,Flac!!  AFTER EVERYTHING IS FINE YOU ARE GONNA VERY HAPPY WITH PURCHASE!!"
        }
    ]
}